{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 200, 30], "dtype": "int32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [6000]}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "embedding", "class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 25001, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "reshape", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "target_shape": [1, 200, 6000]}, "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 20, "kernel_size": [1, 200], "strides": [1, 200], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 20, "kernel_size": [1, 400], "strides": [1, 200], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 20, "kernel_size": [1, 600], "strides": [1, 200], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "pooling_1", "class_name": "MaxPooling2D", "config": {"name": "pooling_1", "trainable": true, "pool_size": [1, 30], "padding": "valid", "strides": [1, 30], "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "pooling_2", "class_name": "MaxPooling2D", "config": {"name": "pooling_2", "trainable": true, "pool_size": [1, 29], "padding": "valid", "strides": [1, 29], "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "pooling_3", "class_name": "MaxPooling2D", "config": {"name": "pooling_3", "trainable": true, "pool_size": [1, 28], "padding": "valid", "strides": [1, 28], "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "permuted_1", "class_name": "Permute", "config": {"name": "permuted_1", "trainable": true, "dims": [2, 1, 3]}, "inbound_nodes": [[["pooling_1", 0, 0, {}]]]}, {"name": "permuted_2", "class_name": "Permute", "config": {"name": "permuted_2", "trainable": true, "dims": [2, 1, 3]}, "inbound_nodes": [[["pooling_2", 0, 0, {}]]]}, {"name": "permuted_3", "class_name": "Permute", "config": {"name": "permuted_3", "trainable": true, "dims": [2, 1, 3]}, "inbound_nodes": [[["pooling_3", 0, 0, {}]]]}, {"name": "conv_1", "class_name": "Reshape", "config": {"name": "conv_1", "trainable": true, "target_shape": [200, 20]}, "inbound_nodes": [[["permuted_1", 0, 0, {}]]]}, {"name": "conv_2", "class_name": "Reshape", "config": {"name": "conv_2", "trainable": true, "target_shape": [200, 20]}, "inbound_nodes": [[["permuted_2", 0, 0, {}]]]}, {"name": "conv_3", "class_name": "Reshape", "config": {"name": "conv_3", "trainable": true, "target_shape": [200, 20]}, "inbound_nodes": [[["permuted_3", 0, 0, {}]]]}, {"name": "sentence_vectors", "class_name": "Merge", "config": {"name": "sentence_vectors", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv_1", 0, 0, {"mask": [null, null, null]}], ["conv_2", 0, 0, {"mask": [null, null, null]}], ["conv_3", 0, 0, {"mask": [null, null, null]}]]]}, {"name": "sentence_predictions", "class_name": "TimeDistributed", "config": {"name": "sentence_predictions", "trainable": false, "layer": {"class_name": "Dense", "config": {"name": "sentence_prediction", "trainable": true, "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["sentence_vectors", 0, 0, {}]]]}, {"name": "permuted_sent_vectors", "class_name": "Permute", "config": {"name": "permuted_sent_vectors", "trainable": true, "dims": [2, 1]}, "inbound_nodes": [[["sentence_vectors", 0, 0, {}]]]}, {"name": "sentence_weights", "class_name": "TimeDistributed", "config": {"name": "sentence_weights", "trainable": true, "layer": {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000S\u0000\u0000\u0000s\u001e\u0000\u0000\u0000t\u0000j\u0001|\u0000d\u0000d\u0000\u0085\u0002d\u0001d\u0002\u0085\u0002f\u0002\u0019\u0000d\u0003d\u0004\u008d\u0002S\u0000)\u0005N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0001\u00da\u0004axis)\u0002\u00da\u0001K\u00da\u0003max)\u0001\u00da\u0001x\u00a9\u0000r\b\u0000\u0000\u0000\u00fa//home/byron/code/rationale-CNN/rationale_CNN.py\u00da\b<lambda>g\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}}}, "inbound_nodes": [[["sentence_predictions", 0, 0, {}]]]}, {"name": "doc_vector", "class_name": "Merge", "config": {"name": "doc_vector", "mode": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u001e\u0000\u0000\u0000|\u0000d\u0001\u0019\u0000|\u0000d\u0002\u0019\u0000\u0002\u0000}\u0001}\u0002t\u0000j\u0001|\u0001|\u0002\u0083\u0002S\u0000)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\tbatch_dot)\u0003\u00da\u0006inputs\u00da\fsent_vectors\u00da\fsent_weights\u00a9\u0000r\b\u0000\u0000\u0000\u00fa//home/byron/code/rationale-CNN/rationale_CNN.py\u00da\u000bscale_mergel\u0001\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u0012\u0001", null, null], "mode_type": "lambda", "concat_axis": -1, "dot_axes": -1, "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u001c\u0000\u0000\u0000t\u0000|\u0000\u0083\u0001d\u0001\u0019\u0000}\u0001|\u0001d\u0001\u0019\u0000|\u0001d\u0002\u0019\u0000f\u0002S\u0000)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0001\u00da\u0004list)\u0002\u00da\u000binput_shapeZ\u000einput_shape_ls\u00a9\u0000r\u0005\u0000\u0000\u0000\u00fa//home/byron/code/rationale-CNN/rationale_CNN.py\u00da\u0018scale_merge_output_shapep\u0001\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0003\f\u0002", null, null], "output_shape_type": "lambda", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["permuted_sent_vectors", 0, 0, {"mask": [null, null]}], ["sentence_weights", 0, 0, {"mask": [null, null]}]]]}, {"name": "reshaped_doc", "class_name": "Reshape", "config": {"name": "reshaped_doc", "trainable": true, "target_shape": [60]}, "inbound_nodes": [[["doc_vector", 0, 0, {}]]]}, {"name": "doc_v_dropout", "class_name": "Dropout", "config": {"name": "doc_v_dropout", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["reshaped_doc", 0, 0, {}]]]}, {"name": "doc_prediction", "class_name": "Dense", "config": {"name": "doc_prediction", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["doc_v_dropout", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["doc_prediction", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}